{
  "groupName": "Weird Tech Group",
  "HQ": "2108 Yummi Road, ABC District, Seoul, South Korea",
  "established": 1949,
  "active": true,
  "productDeals": [
    {
      "productName": "TKSTAR GPS Tracker",
      "productPrice": 46.99,
      "productDesc": "A small GPS tracker with a long three-month battery life allows you a quick, convenient, and cheap way to keep track of your possessions, from car to suitcase. And for now, you can enjoy 10% off the TKSTAR GPS Tracker, which is a good quality, robust, and reliable device.",
      "productKeyFs": [
        "Long Battery Life",
        "Good Quality",
        "Robust GPS Tracker"
      ],
      "img": "GPS.jpg"
    },

    {
      "productName": "AMERICAN RED CROSS EMERGENCY NOAA WEATHER RADIO",
      "productPrice": 30.99,
      "productDesc": "A portable, wind-up and solar rechargeable radio that also doubles as a smartphone charger and LED light. Perfect for emergencies and camping trips.",
      "productKeyFs": ["Smart Phone Charger", "LED Light", "Super Portable"],
      "img": "AMERICAN-RED-CROSS-EMERGENCY-NOAA-WEATHER-RADIO.jpg"
    },

    {
      "productName": "IROBOT ROOMBA E5",
      "productPrice": 280.99,
      "productDesc": "Who doesn't want a robot that goes around your house cleaning it? It's living in the future, right? Well, there's no better time to pick up an iRobot Roomba E5 now that it has had a whopping 27% wiped off the price.",
      "productKeyFs": ["Robot Cleaner", "Lightweight", "Tiny & Good Quality"],
      "img": "IROBOT-ROOMBA-E5.jpg"
    },

    {
      "productName": "THERAGUN",
      "productPrice": 199.99,
      "productDesc": "Buying something that wallops you at a rate of a few hits per second doesn't seem like something people would pay for, but that's what a Theragun is. It's essentially a massage tool for people who don't have time for a massage. And for Black Friday, Theragun has up to $200 devices.",
      "productKeyFs": ["Tiny & Good Quality", "Massage Device", "Portable"],
      "img": "THERAGUN.jpg"
    },

    {
      "productName": "DJI",
      "productPrice": 79.99,
      "productDesc": "If you like vacuum cleaners that go around your home, keeping it clean, then chances are you are also the sort of person who likes other futuristic gadgets. And what is more space-age and modern than a drone. And DJI drones are about as cool as they get.",
      "productKeyFs": [
        "Small Vacum Cleaners",
        "Future Tech Drone Like",
        "Orange and Little"
      ],
      "img": "DJI.jpg"
    }
  ]
}
